# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |
m = int(input("Введите трехзначное число"))
if m//1000>=1:
    print("Ошибка")
else:
    d1 = m//100
    d3 = m%10
    d2 = (m%100)//10
    print(f" {d1+d2+d3} ({d1} + {d2} + {d3})")